import React from 'react';
import St from '../Components/St';
import StWrapper from '../Components/StWrapper';

const ChaturShloki = ({navigation}) => {
  return (
    <StWrapper
      navigation={navigation}
      back={'ShotramScreen'}
      title={'ಚತುಶ್ಲೋಕೀ'}>
      <St
        line1={'ಶ್ರೀಮಾನ್ ವೇಂಕಟನಾಥಾರ್ಯಃ ಕವಿತಾರ್ಕಿಕಕೇಸರೀ |'}
        line2={'ವೇದಾಂತಾಚಾರ್ಯವರ್ಯೋಮೇ ಸನ್ನಿಧತ್ತಾಂ ಸದಾಹೃದಿ||'}
      />
      <St
        line1={'ವಿಗಾಹೇ ಯಾಮುನಂ ತೀರ್ಥಂ ಸಾಧು ಬೃಂದಾವನೇ ಸ್ಥಿತಂ|'}
        line2={'ನಿರಸ್ತ ಜಿಹ್ಮಗ ಸ್ಪರ್ಷೇ ಯತ್ರ ಕೃಷ್ಣಃ ಕೃತಾಧರಃ ||'}
      />
      <St
        line1={'ನಮೋನಮೋ ಯಾಮುನಾಯ ಯಾಮುನಾಯ ನಮೋನಮಃ|'}
        line2={'ನಮೋನಮೋ ಯಾಮುನಾಯ ಯಾಮುನಾಯ ನಮೋನಮಃ||'}
      />
      <St
        line1={'ಕಾಂತಸ್ತೇ ಪುರುಷೋತ್ತಮಃ ಫಣಿಪತಿಃ ಶಯ್ಯಾ„ಸನಂ ವಾಹನಂ'}
        line2={'ವೇದಾತ್ಮಾವಿಹಗೇಶ್ವರೋ ಯವನಿಕಾ ಮಾಯಾ ಜಗನ್ಮೋಹಿನೀ|'}
      />
      <St
        line1={'ಬ್ರಹ್ಮೇಶಾದಿ ಸುರವ್ರಜಃ ಸದಯಿತಃ ತ್ವದ್ದಾಸ ದಾಸೀಗಣಃ '}
        line2={'ಶ್ರೀರಿತ್ಯೇವಚನಾಮ ತೇ ಭಗವತಿ ಬ್ರೂಮಃ ಕಥಂ ತ್ವಾಂವಯಂ ||1||'}
      />
      <St
        line1={'ಯಸ್ಯಾಸ್ತೇ ಮಹಿಮಾನಮಾತ್ಮನ ಇವ ತ್ವದ್ವಲ್ಲಭೋ„ಪಿ ಪ್ರಭುಃ'}
        line2={'ನಾಲಂ ಮಾತುಮಿಯತ್ತಯಾ ನಿರವಧಿಂ ನಿತ್ಯಾನುಕೂಲಂಸ್ವತಃ|'}
        line3={'ತಾಂತ್ವಾಂ ದಾಸಇತಿ ಪ್ರಪನ್ನ ಇತಿ ಚ ಸ್ತೋಷ್ಯಾಮ್ಯಹಂನಿರ್ಭಯಃ'}
        line4={'ಲೋಕೈಕೇಶ್ವರಿ ಲೋಕನಾಥದಯಿತೇ ದಾಂತೇದಯಾಂತೇವಿದò||2||'}
      />
      <St
        line1={'ಈಷತ್ ತ್ವತ್ಕರುಣಾ ನಿರೀಕ್ಷಣ ಸುಧಾ ಸಂಧುಕ್ಷಣಾದ್ರಕ್ಷ್ಯತೇ'}
        line2={'ನಷ್ಟಂ ಪ್ರಾಕ್ ತದಲಾಭತಸ್ತ್ರಿಭುವನಂ ಸಂಪ್ರತ್ಯನಂತೋದಯಂ|'}
        line3={'ಶ್ರೇಯೋ ನ ಹ್ಯರವಿಂದಲೋಚನ ಮನಃ ಕಾಂತಾ ಪ್ರಸಾದಾದೃತೇ'}
        line4={'ಸಂಸೃತ್ಯಕ್ಷರ ವೈಷ್ಣವಾಧ್ವಸು ನೃಣಾಂ ಸಂಭಾವ್ಯತೇ ಕರ್ಹಿಚಿತ್ ||3||'}
      />
      <St
        line1={' ಶಾಂತಾನಂತ ಮಹಾವಿಭೂತಿ ಪರಮಂ ಯದ್ಬ್ರಹ್ಮ ರೂಪಂಹರೇಃ'}
        line2={'ಮೂರ್ತಂಬ್ರಹ್ಮ ತತೋ„ಪಿ ತತ್ಪ್ರಿಯತರಂ ರೂಪಂಯದತ್ಯದ್ಭುತಂ|'}
        line3={'ಯಾನ್ಯನ್ಯಾನಿಯಥಾಸುಖಂವಿಹರತೋ ರೂಪಾಣಿ ಸರ್ವಾಣಿತಾನಿ'}
        line4={'ಆಹುಃ ಸ್ವೈರನುರೂಪ ರೂಪವಿಭವೈಃ ಗಾಢೋಪಗೂಢಾನಿ ತೇ ||4||'}
      />
      <St
        line1={'ಆಕಾರ ತ್ರಯ ಸಂಪನ್ನಾಂ ಅರವಿಂದ ನಿವಾಸಿನೀಂ |'}
        line2={'ಅಶೇಷ ಜಗದೀಶಿತ್ರೀಂ ವಂದೇ ವರದ ವಲ್ಲಭಾಂ ||5||'}
      />
      <St
        line1={'ಭಗವನ್ನಾರಾಯಣಾಭಿಮತಾನುರೂಪ ಸ್ವರೂಪರೂಪ'}
        line2={'ಗುಣವಿಭವೈಶ್ವರ್ಯ ಶೀಲಾದ್ಯನವದಿಕ '}
        line3={'ಅತಿಶಯಾ„ಸಂಖ್ಯೇಯ ಕಲ್ಯಾಣ ಗುಣಗಣಾಂ,'}
        line4={'ಪದ್ಮವನಾಲಯಾಂ ಭಗವತೀಂ ಶ್ರಿಯಂ ದೇವೀಂ'}
        line5={'ನಿತ್ಯಾನುಪಾಯಿನೀಂ ನಿರವದ್ಯಾಂ ದೇವದೇವ ದಿವ್ಯಮಹಿಷೀಂ,'}
        line6={'ಅಖಿಲ ಜಗನ್ಮಾತರಂ ಅಸ್ಮನ್ಮಾತರಂ'}
        line7={'ಅಶರಣ್ಯ ಶರಣ್ಯಾಂ ಅನನ್ಯಶರಣಃ ಶರಣಂ ಅಹಂ ಪ್ರಪದ್ಯೇ ||6||'}
      />
      <St
        line1={'ಉಲ್ಲಾಸ ಪಲ್ಲವಿತ ಪಾಲಿತ ಸಪ್ತಲೊಕೀ'}
        line2={'ನಿರ್ವಾಹ ಕೋರಕಿತ ನೇಮ ಕಟಾಕ್ಷಲೀಲಾಂ |'}
        line3={'ಶ್ರೀರಂಗ ಹರ್ಮ್ಯತಲ ಮಙ್ಗಲ ದೀಪರೇಖಾಂ'}
        line4={'ಶ್ರೀರಂಗರಾಜ ಮಹಿಷೀಂ ಶ್ರಿಯಮಾಶ್ರಯಾಮಃ ||7||'}
      />
      <St
        line1={'ಸಮಸ್ತ ಜನನೀಂ ವಂದೇ ಚೈತನ್ಯ ಸ್ತನ್ಯ ದಾಯಿನೀಂ |'}
        line2={'ಶ್ರೇಯಸೀಂ ಶ್ರೀನಿವಾಸಸ್ಯ ಕರುಣಾಮಿವ ರೂಪಿಣೀಂ ||8||'}
      />
      <St
        line1={'ಕಲ್ಯಾಣಾನಾಂ ಅವಿಕಲ ನಿಧಿಃ ಕಾಪಿ ಕಾರುಣ್ಯ ಸೀಮಾ '}
        line2={'ನಿತ್ಯಾಮೋದಾ ನಿಗಮ ವಚಸಾ ಮೌಳಿಮಂದಾರ ಮಾಲಾ |'}
        line3={'ಸಂಪತ್ ದಿವ್ಯಾ ಮಧುವಿಜಯಿನಃ ಸನ್ನಿಧತ್ತಾಮ್ ಸದಾಮೇ'}
        line4={'ಸೈಷಾದೇವೀ ಸಕಲಭುವನಃ ಪ್ರಾರ್ಥನಾ ಕಾಮಧೇನುಃ ||9||'}
      />
      <St
        line1={'ಉಪಚಿತ ಗುರುಭಕ್ತೇರುತ್ಥಿತಂ ವೇಂಕಟೇಶಾತ್'}
        line2={'ಕಲಿಕಲುಷ ನಿವೃತ್ಯೈ ಕಲ್ಪಮಾನಂ ಪ್ರಜಾನಾಂ|'}
        line3={'ಸರಸಿಜ ನಿಲಯಾಯಾಃ ಸ್ತೋತ್ರಮೇತತ್ ಪಠಂತಃ'}
        line4={'ಸಕಲ ಕುಶಲ ಸೀಮಾಃ ಸಾರ್ವಭೌಮಾ ಭವಂತಿ||10||'}
      />
    </StWrapper>
  );
};

export default ChaturShloki;
