import React from 'react';
import StWrapper from '../Components/StWrapper';
import St from '../Components/St';
const DheeraMaruthi = ({navigation}) => {
  return (
    <StWrapper
      navigation={navigation}
      back={'BhajaneScreen'}
      title={'ಧೀರ ಮಾರುತಿ ಗಂಭೀರ ಮಾರುತಿ'}>
      <St
        line1={'ಧೀರ ಮಾರುತಿ ಗಂಭೀರ ಮಾರುತಿ |'}
        line2={'ಶೂರ ಮಾರುತಿ ರಾಮಶೂರ ಮಾರುತಿ||'}
      />
      <St
        line1={'ಶಕ್ತ ಮಾರುತಿ ರಾಮ ಭಕ್ತ ಮಾರುತಿ|'}
        line2={'ಅಂಜನಿ ಮಾರುತಿ ಹನುಮಂತ ಮಾರುತಿ ||'}
      />
      <St
        line1={'ಹನುಮಂತ ಮಾರುತಿ  ಬಲವಂತ ಮಾರುತಿ |'}
        line2={'ಬಲವಂತ ಮಾರುತ ಗುಣವಂತ ಮಾರುತಿ ||'}
      />
      <St line1={'ಮಾರುತಿ ಮಾರುತಿ ಮಾರುತಿ ಮಾರುತಿ '} />
      <St
        line1={'ಧೀರ ಮಾರುತಿ ಗಂಭೀರ ಮಾರುತಿ |'}
        line2={'ಶೂರ ಮಾರುತಿ ರಾಮಶೂರ ಮಾರುತಿ||'}
      />
      <St
        line1={'ಗೀತಾ ಮಾರುತಿ ಸಂಗೀತ ಮಾರುತಿ '}
        line2={'ಯೋಗಿ ಮಾರುತಿ ಪರಮತ್ಯಾಗಿ ಮಾರುತಿ'}
      />
      <St
        line1={'ತ್ಯಾಗಿ ಮಾರುತಿ ವಿರಾಗಿ ಮಾರುತಿ'}
        line2={'ಪವನ ಮಾರುತಿ ಲಂಕಾ ದಹನ ಮಾರುತಿ'}
      />
      <St
        line1={'ಮೌನಿ ಮಾರುತಿ ಮಹಾಜ್ಞಾನಿ ಮಾರುತಿ'}
        line2={'ದಕ್ಷ ಮಾರುತಿ ಲಕ್ಷ್ಮಣ ರಕ್ಷಾ ಮಾರುತಿ'}
      />
      <St
        line1={'ಸದಯಾ ಮಾರುತಿ ರಾಮ ಹೃದಯ ಮಾರುತಿ'}
        line2={'ರಾಮಧೂತ ಮಾರುತಿ ಭೀಮಕಾಯ ಮಾರುತಿ'}
      />
      <St
        line1={'ಎತ್ತಿ ನಿನಗೆ ಆರತಿ ಮಾಡುವೆ ನಿನ್ನ ಕೀರುತಿ'}
        line2={'ಮಾರುತಿ ಮಾರುತಿ ಮಾರುತಿ'}
      />
      <St
        line1={'ಧೀರ ಮಾರುತಿ ಗಂಭೀರ ಮಾರುತಿ |'}
        line2={'ಶೂರ ಮಾರುತಿ ರಾಮಶೂರ ಮಾರುತಿ||'}
      />
    </StWrapper>
  );
};

export default DheeraMaruthi;
