import React from 'react';
import St from '../Components/St';
import StWrapper from '../Components/StWrapper';

const GopalaVimshathi = ({navigation}) => {
  return (
    <StWrapper
      navigation={navigation}
      back={'ShotramScreen'}
      title={'ಗೋಪಾಲ ವಿಂಶತಿ'}>
      <St
        line1={'ವಂದೇ ಬೃಂದಾವನಚರಂ ವಲ್ಲವೀ ಜನವಲ್ಲಭಂ |'}
        line2={'ಜಯಂತೀಸಂಭವಂ ಧಾಮ ವೈಜಯಂತೀ ವಿಭೂಷಣಮ್ || ೧ ||'}
      />
      <St
        line1={'ವಾಚಂ ನಿಜಾಂಕರಸಿಕಾಂ ಪ್ರಸಮೀಕ್ಷಮಾಣೋ'}
        line2={'ವಕ್ತ್ರಾರವಿಂದವಿನಿವೇಶಿತಪಾಂಚಜನ್ಯಃ |'}
        line3={'ವರ್ಣತ್ರಿಕೋಣರುಚಿರೇ ವರಪುಂಡರೀಕೇ'}
        line4={'ಬದ್ಧಾಸನೋ ಜಯತಿ ವಲ್ಲವಚಕ್ರವರ್ತೀ || ೨ ||'}
      />
      <St
        line1={'ಆಮ್ನಾಯಗಂಧಿರುಚಿರಸ್ಫುರಿತಾಧರೋಷ್ಠಂ'}
        line2={'ಆಸ್ರಾವಿಲೇಕ್ಷಣಮನುಕ್ಷಣಮಂದಹಾಸಂ |'}
        line3={'ಗೋಪಾಲಡಿಂಭವಪುಷಂ ಕುಹನಾ ಜನನ್ಯಾಃ'}
        line4={'ಪ್ರಾಣಸ್ತನಂಧಯಮವೈಮಿ ಪರಂ ಪುಮಾಂಸಮ್ || ೩ ||'}
      />
      <St
        line1={'ಆವಿರ್ಭವತ್ವನಿಭೃತಾಭರಣಂ ಪುರಸ್ತಾತ್'}
        line2={'ಆಕುಂಚಿತೈಕಚರಣಂ ನಿಭೃತಾನ್ಯಪಾದಂ |'}
        line3={'ದಧ್ನಾನಿಮಂಥಮುಖರೇಣ ನಿಬದ್ಧತಾಳಂ'}
        line4={'ನಾಥಸ್ಯ ನಂದಭವನೇ ನವನೀತನಾಟ್ಯಮ್ || ೪ ||'}
      />
      <St
        line1={'ಹರ್ತುಂ ಕುಂಭೇ ವಿನಿಹಿತಕರಸ್ಸ್ವಾದು ಹೈಯಂಗವೀನಂ'}
        line2={'ದೃಷ್ಟ್ವಾ ದಾಮಗ್ರಹಣಚಟುಲಾಂ ಮಾತರಂ ಜಾತರೋಷಾಂ |'}
        line3={'ಪಾಯಾದೀಷತ್ಪ್ರಚಲಿತಪದೋ ನಾಪಗಚ್ಛನ್ನ ತಿಷ್ಠನ್'}
        line4={'ಮಿಥ್ಯಾಗೋಪಸ್ಸಪದಿ ನಯನೇ ಮೀಲಯನ್ ವಿಶ್ವಗೋಪ್ತಾ || ೫ ||'}
      />
      <St
        line1={'ವ್ರಜಯೋಷಿದಪಾಂಗ ವೇದನೀಯಂ'}
        line2={'ಮಧುರಾಭಾಗ್ಯಮನನ್ಯಭೋಗ್ಯಮೀಡೇ |'}
        line3={'ವಸುದೇವವಧೂ ಸ್ತನಂಧಯಂ ತತ್'}
        line4={'ಕಿಮಪಿ ಬ್ರಹ್ಮ ಕಿಶೋರಭಾವದೃಶ್ಯಮ್ || ೬ ||'}
      />
      <St
        line1={'ಪರಿವರ್ತಿತಕಂಧರಂ ಭಯೇನ'}
        line2={'ಸ್ಮಿತಫುಲ್ಲಾಧರಪಲ್ಲವಂ ಸ್ಮರಾಮಿ |'}
        line3={'ವಿಟಪಿತ್ವನಿರಾಸಕಂ ಕಯೋಶ್ಚಿತ್'}
        line4={'ವಿಪುಲೋಲೂಖಲಕರ್ಷಕಂ ಕುಮಾರಮ್ || ೭ ||'}
      />
      <St
        line1={'ನಿಕಟೇಷು ನಿಶಾಮಯಾಮಿ ನಿತ್ಯಂ'}
        line2={'ನಿಗಮಾಂತೈರಧುನಾಽಪಿ ಮೃಗ್ಯಮಾಣಂ |'}
        line3={'ಯಮಳಾರ್ಜುನದೃಷ್ಟಬಾಲಕೇಳಿಂ'}
        line4={'ಯಮುನಾಸಾಕ್ಷಿಕಯೌವನಂ ಯುವಾನಮ್ || ೮ ||'}
      />
      <St
        line1={'ಪದವೀಮದವೀಯಸೀಂ ವಿಮುಕ್ತೇಃ'}
        line2={'ಅಟವೀ ಸಂಪದಮಂಬು ವಾಹಯಂತೀಂ |'}
        line3={'ಅರುಣಾಧರಸಾಭಿಲಾಷವಂಶಾಂ'}
        line4={'ಕರುಣಾಂ ಕಾರಣಮಾನುಷೀಂ ಭಜಾಮಿ || ೯ ||'}
      />
      <St
        line1={'ಅನಿಮೇಷನಿಷೇವಣೀಯಮಕ್ಷ್ಣೋಃ'}
        line2={'ಅಜಹದ್ಯೌವನಮಾವಿರಸ್ತು ಚಿತ್ತೇ |'}
        line3={'ಕಲಹಾಯಿತಕುಂತಲಂ ಕಲಾಪೈಃ'}
        line4={'ಕರುಣೋನ್ಮಾದಕವಿಭ್ರಮಂ ಮಹೋ ಮೇ || ೧೦ ||'}
      />
      <St
        line1={'ಅನುಯಾಯಿಮನೋಜ್ಞವಂಶನಾಳೈಃ'}
        line2={'ಅವತು ಸ್ಪರ್ಶಿತವಲ್ಲವೀವಿಮೋಹೈಃ |'}
        line3={'ಅನಘಸ್ಮಿತಶೀತಲೈರಸೌ ಮಾಮ್'}
        line4={'ಅನುಕಂಪಾಸರಿದಂಬುಜೈರಪಾಂಗೈಃ || ೧೧ ||'}
      />
      <St
        line1={'ಅಧರಾಹಿತಚಾರುವಂಶನಾಳಾಃ'}
        line2={'ಮಕುಟಾಲಂಬಿಮಯೂರಪಿಂಛಮಾಲಾಃ |'}
        line3={'ಹರಿನೀಲಶಿಲಾವಿಭಂಗನೀಲಾಃ'}
        line4={'ಪ್ರತಿಭಾಸ್ಸಂತು ಮಮಾಂತಿಮಪ್ರಯಾಣೇ || ೧೨ ||'}
      />
      <St
        line1={'ಅಖಿಲಾನವಲೋಕಯಾಮಿ ಕಾಲಾನ್'}
        line2={'ಮಹಿಳಾಧೀನಭುಜಾಂತರಸ್ಯಯೂನಃ |'}
        line3={'ಅಭಿಲಾಷಪದಂ ವ್ರಜಾಂಗನಾನಾಮ್'}
        line4={'ಅಭಿಲಾಪಕ್ರಮದೂರಮಾಭಿರೂಪ್ಯಮ್ || ೧೩ |'}
      />
      <St
        line1={'ಹೃದಿ ಮುಗ್ಧಶಿಖಂಡಮಂಡನೋ'}
        line2={'ಲಿಖಿತಃ ಕೇನ ಮಮೈಷ ಶಿಲ್ಪಿನಾ |'}
        line3={'ಮದನಾತುರಪಲ್ಲವಾಂಗನಾ-'}
        line4={'ವದನಾಂಭೋಜದಿವಾಕರೋ ಯುವಾ || ೧೪ ||'}
      />
      <St
        line1={'ಮಹಸೇ ಮಹಿತಾಯ ಮೌಳಿನಾ'}
        line2={'ವಿನತೇನಾಂಜಲಿಮಂಜನತ್ವಿಷೇ |'}
        line3={'ಕಲಯಾಮಿ ವಿಮುಗ್ಧವಲ್ಲವೀ-'}
        line4={'ವಲಯಾಭಾಷಿತಮಂಜುವೇಣವೇ || ೧೫ ||'}
      />
      <St
        line1={'ಜಯತಿ ಲಲಿತವೃತ್ತಿಂ ಶಿಕ್ಷಿತೋ ವಲ್ಲವೀನಾಂ'}
        line2={'ಶಿಥಿಲವಲಯಶಿಂಜಾಶೀತಲೈರ್ಹಸ್ತತಾಳೈಃ |'}
        line3={'ಅಖಿಲಭುವನರಕ್ಷಾಗೋಪವೇಷಸ್ಯ ವಿಷ್ಣೋಃ'}
        line4={'ಅಧರಮಣಿಸುಧಾಯಾಮಂಶವಾನ್ವಂಶನಾಳಃ || ೧೬ ||'}
      />
      <St
        line1={'ಚಿತ್ರಾಕಲ್ಪ ಶ್ರವಸಿ ಕಲಯನ್ ಲಾಂಗಲೀಕರ್ಣಪೂರಂ'}
        line2={'ಬರ್ಹೋತ್ತಂಸಸ್ಫುರಿತಚಿಕುರೋ ಬಂಧುಜೀವಂ ದಧಾನಃ |'}
        line3={'ಗುಂಜಾಬದ್ಧಾಮುರಸಿ ಲಲಿತಾಂ ಧಾರಯನ್ ಹಾರಯಷ್ಟಿಂ'}
        line4={'ಗೋಪಸ್ತ್ರೀಣಾಂ ಜಯತಿ ಕಿತವಃ ಕೋಽಪಿ ಕೌಮಾರಹಾರೀ || ೧೭ ||'}
      />
      <St
        line1={'ಲೀಲಾಯಷ್ಟಿಂ ಕರಕಿಸಲಯೇ ದಕ್ಷಿಣೇ ನ್ಯಸ್ಯ ಧನ್ಯಾಂ'}
        line2={'ಅಂಸೇ ದೇವ್ಯಾಃ ಪುಲಕರುಚಿರೇ ಸನ್ನಿವಿಷ್ಟಾನ್ಯಬಾಹುಃ |'}
        line3={'ಮೇಘಶ್ಯಾಮೋ ಜಯತಿ ಲಲಿತೋ ಮೇಖಲಾದತ್ತವೇಣುಃ '}
        line4={'ಗುಂಜಾಪೀಡಸ್ಫುರಿತಚಿಕುರೋ ಗೋಪಕನ್ಯಾಭುಜಂಗಃ || ೧೮ ||'}
      />
      <St
        line1={'ಪ್ರತ್ಯಾಲೀಢಸ್ಥಿತಿಮಧಿಗತಾಂ ಪ್ರಾಪ್ತಗಾಢಾಂಗಪಾಳಿಂ'}
        line2={'ಪಶ್ಚಾದೀಷನ್ಮಿಳಿತನಯನಾಂ ಪ್ರೇಯಸೀಂ ಪ್ರೇಕ್ಷಮಾಣಃ |'}
        line3={'ಭಸ್ತ್ರಾಯಂತ್ರಪ್ರಣಿಹಿತಕರೋ ಭಕ್ತಜೀವಾತುರವ್ಯಾತ್'}
        line4={'ವಾರಿಕ್ರೀಡಾನಿಬಿಡವಸನೋ ವಲ್ಲವೀವಲ್ಲಭೋ ನಃ || ೧೯ ||'}
      />
      <St
        line1={'ವಾಸೋ ಹೃತ್ವಾ ದಿನಕರಸುತಾಸನ್ನಿಧೌ ವಲ್ಲವೀನಾಂ'}
        line2={'ಲೀಲಾಸ್ಮೇರೋ ಜಯತಿ ಲಲಿತಾಮಾಸ್ಥಿತಃ ಕುಂದಶಾಖಾಂ |'}
        line3={'ಸವ್ರೀಡಾಭಿಸ್ತದನು ವಸನೇ ತಾಭಿರಭ್ಯರ್ಥ್ಯಮಾನೇ'}
        line4={'ಕಾಮೀ ಕಶ್ಚಿತ್ಕರಕಮಲಯೋರಂಜಲಿಂ ಯಾಚಮಾನಃ || ೨೦ ||'}
      />
      <St
        line1={'ಇತ್ಯನನ್ಯಮನಸಾ ವಿನಿರ್ಮಿತಾಂ'}
        line2={'ವೇಂಕಟೇಶಕವಿನಾ ಸ್ತುತಿಂ ಪಠನ್ |'}
        line3={'ದಿವ್ಯವೇಣುರಸಿಕಂ ಸಮೀಕ್ಷತೇ'}
        line4={'ದೈವತಂ ಕಿಮಪಿ ಯೌವತಪ್ರಿಯಮ್ || ೨೧ ||'}
      />
      <St line1={'ಇತಿ ಶ್ರೀವೇದಾಂತಾಚಾರ್ಯಸ್ಯ ಕೃತಿಷು ಗೋಪಾಲವಿಂಶತಿಃ ||'} />
    </StWrapper>
  );
};

export default GopalaVimshathi;
