import React from 'react';
import StWrapper from '../Components/StWrapper';
import St from '../Components/St';
import SubHeader from '../Components/SubHeader';

const HanumanChalisa = ({navigation}) => {
  return (
    <StWrapper
      navigation={navigation}
      back={'BhajaneScreen'}
      title={'ಹನುಮಾನ್ ಚಾಲಿಸಾ'}>
      <SubHeader title="ದೋಹಾ" />
      <St
        line1={'ಶ್ರೀ ಗುರು ಚರಣ ಸರೋಜ ರಜ ನಿಜಮನ ಮುಕುರ ಸುಧಾರಿ |'}
        line2={'ವರಣೌ ರಘುQವರ ವಿಮಲಯಶ ಜೋ ದಾಯಕ ಫಲಚಾರಿ ||'}
        line3={'ಬುದ್ಧಿಹೀನ ತನುಜಾನಿಕೈ ಸುಮಿರೌ ಪವನ ಕುಮಾರ |'}
        line4={'ಬಲ ಬುದ್ಧಿ ವಿದ್ಯಾ ದೇಹು ಮೋಹಿ ಹರಹು ಕಲೇಶ ವಿಕಾರ್ ||'}
      />
      <SubHeader title="ಚೌಪಾಈ" />
      <St
        line1={'ಜಯ ಹನುಮಾನ ಜ್ಞಾನ ಗುಣ ಸಾಗರ |'}
        line2={'ಜಯ ಕಪೀಶ ತಿಹು ಲೋಕ ಉಜಾಗರ || 1 ||'}
      />
      <St
        line1={'ರಾಮದೂತ ಅತುಲಿತ ಬಲಧಾಮಾ |'}
        line2={'ಅಂಜನಿ ಪುತ್ರ ಪವನಸುತ ನಾಮಾ || 2 ||'}
      />
      <St
        line1={'ಮಹಾವೀರ ವಿಕ್ರಮ ಬಜರಂಗೀ |'}
        line2={'ಕುಮತಿ ನಿವಾರ ಸುಮತಿ ಕೇ ಸಂಗೀ ||3 ||'}
      />
      <St
        line1={'ಕಂಚನ ವರಣ ವಿರಾಜ ಸುವೇಶಾ |'}
        line2={'ಕಾನನ ಕುಂಡಲ ಕುಂಚಿತ ಕೇಶಾ || 4 ||'}
      />
      <St
        line1={'ಹಾಥವಜ್ರ ಔ ಧ್ವಜಾ ವಿರಾಜೈ |'}
        line2={'ಕಾಂಥೇ ಮೂಂಜ ಜನೇವೂ ಸಾಜೈ || 5||'}
      />
      <St
        line1={'ಶಂಕರ ಸುವನ ಕೇಸರೀ ನಂದನ |'}
        line2={'ತೇಜ ಪ್ರತಾಪ ಮಹಾಜಗ ವಂದನ || 6 ||'}
      />
      <St
        line1={'ವಿದ್ಯಾವಾನ ಗುಣೀ ಅತಿ ಚಾತುರ |'}
        line2={'ರಾಮ ಕಾಜ ಕರಿವೇ ಕೋ ಆತುರ || 7 ||'}
      />
      <St
        line1={'ಪ್ರಭು ಚರಿತ್ರ ಸುನಿವೇ ಕೋ ರಸಿಯಾ |'}
        line2={'ರಾಮಲಖನ ಸೀತಾ ಮನ ಬಸಿಯಾ || 8||'}
      />
      <St
        line1={'ಸೂಕ್ಷ್ಮ ರೂಪಧರಿ ಸಿಯಹಿ ದಿಖಾವಾ |'}
        line2={'ವಿಕಟ ರೂಪಧರಿ ಲಂಕ ಜರಾವಾ || 9 ||'}
      />
      <St
        line1={'ಭೀಮ ರೂಪಧರಿ ಅಸುರ ಸಂಹಾರೇ |'}
        line2={'ರಾಮಚಂದ್ರ ಕೇ ಕಾಜ ಸಂವಾರೇ || 10 ||'}
      />
      <St
        line1={'ಲಾಯ ಸಂಜೀವನ ಲಖನ ಜಿಯಾಯೇ |'}
        line2={'ಶ್ರೀ ರಘುವೀರ ಹರಷಿ ಉರಲಾಯೇ || 11 ||'}
      />
      <St
        line1={'ರಘುಪತಿ ಕೀನ್ಹೀ ಬಹುತ ಬಡಾಯೀ |'}
        line2={'ತುಮ ಮಮ ಪ್ರಿಯ ಭರತಹಿ ಸಮ ಭಾಯೀ || 12 ||'}
      />
      <St
        line1={'ಸಹಸ ವದನ ತುಮ್ಹರೋ ಯಶಗಾವೈ |'}
        line2={'ಅಸ ಕಹಿ ಶ್ರೀಪತಿ ಕಂಠ ಲಗಾವೈ || 13 ||'}
      />
      <St
        line1={'ಸನಕಾದಿಕ ಬ್ರಹ್ಮಾದಿ ಮುನೀಶಾ |'}
        line2={'ನಾರದ ಶಾರದ ಸಹಿತ ಅಹೀಶಾ || 14 ||'}
      />
      <St
        line1={'ಯಮ ಕುಬೇರ ದಿಗಪಾಲ ಜಹಾಂ ತೇ |'}
        line2={'ಕವಿ ಕೋವಿದ ಕಹಿ ಸಕೇ ಕಹಾಂ ತೇ || 15 ||'}
      />
      <St
        line1={'ತುಮ ಉಪಕಾರ ಸುಗ್ರೀವಹಿ ಕೀನ್ಹಾ |'}
        line2={'ರಾಮ ಮಿಲಾಯ ರಾಜಪದ ದೀನ್ಹಾ || 16 ||'}
      />
      <St
        line1={'ತುಮ್ಹರೋ ಮಂತ್ರ ವಿಭೀಷಣ ಮಾನಾ |'}
        line2={'ಲಂಕೇಶ್ವರ ಭಯೇ ಸಬ ಜಗ ಜಾನಾ || 17 ||'}
      />
      <St
        line1={'ಯುಗ ಸಹಸ್ರ ಯೋಜನ ಪರ ಭಾನೂ |'}
        line2={'ಲೀಲ್ಯೋ ತಾಹಿ ಮಧುರ ಫಲ ಜಾನೂ || 18 ||'}
      />
      <St
        line1={'ಪ್ರಭು ಮುದ್ರಿಕಾ ಮೇಲಿ ಮುಖ ಮಾಹೀ |'}
        line2={'ಜಲಧಿ ಲಾಂಘಿ ಗಯೇ ಅಚರಜ ನಾಹೀ || 19 ||'}
      />
      <St
        line1={'ದುರ್ಗಮ ಕಾಜ ಜಗತ ಕೇ ಜೇತೇ |'}
        line2={'ಸುಗಮ ಅನುಗ್ರಹ ತುಮ್ಹರೇ ತೇತೇ || 20 ||'}
      />
      <St
        line1={'ರಾಮ ದುಆರೇ ತುಮ ರಖವಾರೇ |'}
        line2={'ಹೋತ ನ ಆಜ್ಞಾ ಬಿನು ಪೈಸಾರೇ || 21 ||'}
      />
      <St
        line1={'ಸಬ ಸುಖ ಲಹೈ ತುಮ್ಹಾರೀ ಶರಣಾ |'}
        line2={'ತುಮ ರಕ್ಷಕ ಕಾಹೂ ಕೋ ಡರ ನಾ || 22 ||'}
      />
      <St
        line1={'ಆಪನ ತೇಜ ತುಮ್ಹಾರೋ ಆಪೈ |'}
        line2={'ತೀನೋಂ ಲೋಕ ಹಾಂಕ ತೇ ಕಾಂಪೈ || 23 ||'}
      />
      <St
        line1={'ಭೂತ ಪಿಶಾಚ ನಿಕಟ ನಹಿ ಆವೈ |'}
        line2={'ಮಹವೀರ ಜಬ ನಾಮ ಸುನಾವೈ || 24 ||'}
      />
      <St
        line1={'ನಾಸೈ ರೋಗ ಹರೈ ಸಬ ಪೀರಾ |'}
        line2={'ಜಪತ ನಿರಂತರ ಹನುಮತ ವೀರಾ || 25 ||'}
      />
      <St
        line1={'ಸಂಕಟ ಸೇಂ ಹನುಮಾನ ಛುಡಾವೈ |'}
        line2={'ಮನ ಕ್ರಮ ವಚನ ಧ್ಯಾನ ಜೋ ಲಾವೈ || 26 ||'}
      />
      <St
        line1={'ಸಬ ಪರ ರಾಮ ತಪಸ್ವೀ ರಾಜಾ |'}
        line2={'ತಿನಕೇ ಕಾಜ ಸಕಲ ತುಮ ಸಾಜಾ || 27 ||'}
      />
      <St
        line1={'ಔರ ಮನೋರಧ ಜೋ ಕೋಯಿ ಲಾವೈ |'}
        line2={'ತಾಸು ಅಮಿತ ಜೀವನ ಫಲ ಪಾವೈ || 28 ||'}
      />
      <St
        line1={'ಚಾರೋ ಯುಗ ಪರಿತಾಪ ತುಮ್ಹಾರಾ |'}
        line2={'ಹೈ ಪರಸಿದ್ಧ ಜಗತ ಉಜಿಯಾರಾ || 29 ||'}
      />
      <St
        line1={'ಸಾಧು ಸಂತ ಕೇ ತುಮ ರಖವಾರೇ |'}
        line2={'ಅಸುರ ನಿಕಂದನ ರಾಮ ದುಲಾರೇ || 30 ||'}
      />
      <St
        line1={'ಅಷ್ಠಸಿದ್ಧಿ ನವ ನಿಧಿ ಕೇ ದಾತಾ |'}
        line2={'ಅಸ ವರ ದೀನ್ಹ ಜಾನಕೀ ಮಾತಾ || 31 ||'}
      />
      <St
        line1={'ರಾಮ ರಸಾಯನ ತುಮ್ಹಾರೇ ಪಾಸಾ |'}
        line2={'ಸಾದ ರಹೋ ರಘುಪತಿ ಕೇ ದಾಸಾ || 32 ||'}
      />
      <St
        line1={'ತುಮ್ಹರೇ ಭಜನ ರಾಮಕೋ ಪಾವೈ |'}
        line2={'ಜನ್ಮ ಜನ್ಮ ಕೇ ದುಖ ಬಿಸರಾವೈ || 33 ||'}
      />
      <St
        line1={'ಅಂತ ಕಾಲ ರಘುವರ ಪುರಜಾಯೀ |'}
        line2={'ಜಹಾಂ ಜನ್ಮ ಹರಿಭಕ್ತ ಕಹಾಯೀ || 34 ||'}
      />
      <St
        line1={'ಔರ ದೇವತಾ ಚಿತ್ತ ನ ಧರಯೀ |'}
        line2={'ಹನುಮತ ಸೇಯಿ ಸರ್ವ ಸುಖ ಕರಯೀ || 35 ||'}
      />
      <St
        line1={'ಸಂಕಟ ಕಟೈ ಮಿಟೈ ಸಬ ಪೀರಾ |'}
        line2={'ಜೋ ಸುಮಿರೈ ಹನುಮತ ಬಲ ವೀರಾ || 36 ||'}
      />
      <St
        line1={'ಜೈ ಜೈ ಜೈ ಹನುಮಾನ ಗೋಸಾಯೀ |'}
        line2={'ಕೃಪಾ ಕರೋ ಗುರುದೇವ ಕೀ ನಾಯೀ || 37 ||'}
      />
      <St
        line1={'ಜೋ ಶತ ವಾರ ಪಾಠ ಕರ ಕೋಯೀ |'}
        line2={'ಛೂಟಹಿ ಬಂದಿ ಮಹಾ ಸುಖ ಹೋಯೀ || 38 ||'}
      />
      <St
        line1={'ಜೋ ಯಹ ಪಡೈ ಹನುಮಾನ ಚಾಲೀಸಾ |'}
        line2={'ಹೋಯ ಸಿದ್ಧಿ ಸಾಖೀ ಗೌರೀಶಾ || 39 ||'}
      />
      <St
        line1={'ತುಲಸೀದಾಸ ಸದಾ ಹರಿ ಚೇರಾ |'}
        line2={'ಕೀಜೈ ನಾಥ ಹೃದಯ ಮಹ ಡೇರಾ || 40 ||'}
      />
    </StWrapper>
  );
};

export default HanumanChalisa;
