import React from 'react';
import StWrapper from '../Components/StWrapper';
import St from '../Components/St';

const JayaJayaVitala = ({navigation}) => {
  return (
    <StWrapper
      navigation={navigation}
      back={'BhajaneScreen'}
      title={'ಜೈ ಜೈ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}>
      <St
        line1={'ಜೈ ಜೈ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line2={'ಜೈ ಹರಿ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line3={'ಜೈ ಜೈ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line4={'ಜೈ ಹರಿ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
      />
      <St
        line1={'ಅಪತ್ ಬಾಂಧವ ಪಾಂಡುರಂಗ'}
        line2={'ಅನಾಥ ರಕ್ಷಕ ಪಾಂಡುರಂಗ'}
        line3={'ಅಪತ್ ಬಾಂಧವ ಪಾಂಡುರಂಗ'}
        line4={'ಅನಾಥ ರಕ್ಷಕ ಪಾಂಡುರಂಗ'}
        line5={'ಜೈ ಜೈ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line6={'ಜೈ ಹರಿ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line7={'ಜೈ ಜೈ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line8={'ಜೈ ಹರಿ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
      />
      <St
        line1={'ಭಕ್ತ ಪೋಶಕ ಪಾಂಡುರಂಗ'}
        line2={'ಮುಕ್ತಿ ಪ್ರದಾಯಕ ಪಾಂಡುರಂಗ'}
        line3={'ಭಕ್ತ ಪೋಶಕ ಪಾಂಡುರಂಗ'}
        line4={'ಮುಕ್ತಿ ಪ್ರದಾಯಕ ಪಾಂಡುರಂಗ'}
        line5={'ಜೈ ಜೈ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line6={'ಜೈ ಹರಿ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line7={'ಜೈ ಜೈ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line8={'ಜೈ ಹರಿ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
      />
      <St
        line1={'ತಾಂಡೆ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line2={'ಥಾಯ್ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line3={'ತಾಂಡೆ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line4={'ಥಾಯ್ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line5={'ಜೈ ಜೈ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line6={'ಜೈ ಹರಿ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line7={'ಜೈ ಜೈ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line8={'ಜೈ ಹರಿ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
      />
      <St
        line1={'ಬಂಧು ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line2={'ಭಲಾಗ ವಿಟ್ಟಾಲ ಪಾಂಡುರಂಗ'}
        line3={'ಬಂಧು ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line4={'ಭಲಾಗ ವಿಟ್ಟಾಲ ಪಾಂಡುರಂಗ'}
        line5={'ಜೈ ಜೈ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line6={'ಜೈ ಹರಿ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line7={'ಜೈ ಜೈ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line8={'ಜೈ ಹರಿ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
      />
      <St
        line1={'ಪುಂಡರಿಕಾ ವರದಾ ಪಾಂಡುರಂಗ'}
        line2={'ಪಂಡಾರಿ ವಾಸ ಪಾಂಡುರಂಗ'}
        line3={'ಪುಂಡರಿಕಾ ವರದಾ ಪಾಂಡುರಂಗ'}
        line4={'ಪಂಡಾರಿ ವಾಸ ಪಾಂಡುರಂಗ'}
        line5={'ಜೈ ಜೈ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line6={'ಜೈ ಹರಿ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line7={'ಜೈ ಜೈ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
        line8={'ಜೈ ಹರಿ ವಿಟ್ಟಲಾ ಪಾಂಡುರಂಗ'}
      />
      <St
        line1={'ವಿಟ್ಟಲ ವಿಟ್ಟಲ ವಿಟ್ಟಲ ವಿಟ್ಟಲ'}
        line2={'ವಿಟ್ಟಲ ವಿಟ್ಟಲ ವಿಟ್ಟಲ ವಿಟ್ಟಲ'}
      />
    </StWrapper>
  );
};

export default JayaJayaVitala;
