import React from 'react';
import St from '../Components/St';
import StWrapper from '../Components/StWrapper';

const Jitante = ({navigation}) => {
  return (
    <StWrapper
      navigation={navigation}
      back={'ShotramScreen'}
      title={'ಜಿತಂತೇ ಸ್ತೋತ್ರಂ'}>
      <St
        line1={'ಜಿತಂತೇ ಪುಂಡರೀಕಾಕ್ಷ ನಮಸ್ತೇ ವಿಶ್ವಭಾವನ |'}
        line2={'ನಮಸ್ತೇಸ್ತು ಹೃಷೀಕೇಶ ಮಹಾಪುರುಷ ಪುರ್ವಜ ||1||'}
      />
      <St
        line1={'ದೇವಾನಾಂ ದಾನವಾನಾಂ ಚ ಸಾಮಾನ್ಯಂ ಅಧಿದೈವತಂ |'}
        line2={'ಸರ್ವದಾ ಚರಣದ್ವಂದ್ವಂ ವೃಜಾಮಿ ಶರಣಂ ತವ||2||'}
      />
      <St
        line1={'ಏಕಸ್ತ್ವಮಸಿ ಲೋಕಸ್ಯ ಸ್ರಷ್ಟಾ ಸಂಹಾರಕಸ್ತಥಾ|'}
        line2={'ಅಧ್ಯಕ್ಷಶ್ಚಾನುಮಂತಾ ಚ ಗುಣಮಾಯಾ ಸಮಾವೃತಃ||3||'}
      />
      <St
        line1={'ಸಂಸಾರ ಸಾಗರಂ ಘೋರಂ ಅನಂತಕ್ಲೇಶ ಭಾಜನಂ |'}
        line2={'ತ್ವಾ ಮೇವ ಶರಣಂ ಪ್ರಾಪ್ಯ ನಿಸ್ತರಂತಿ ಮನೀಷಿಣಃ ||4||'}
      />
      <St
        line1={'ನ ತೇ ರೂಪಂ ನ ಚಾಕಾರೋ ನಾಯುಧಾನಿ ನ ಚಾಸ್ಪದಂ| '}
        line2={'ತಥಾಪಿ ಪುರುಷಾಕಾರೋ ಭಕ್ತಾನಾಂ ತ್ವಂ ಪ್ರಕಾಶಸೇ ||5||'}
      />
      <St
        line1={'ನೈವ ಕಿಂಚಿತ್ಪರೋಕ್ಷಂ ತೇ ಪ್ರತ್ಯಕ್ಷೋಸಿ ನ ಕಸ್ಯಚಿತ್ |'}
        line2={'ನೈವ ಕಿಂಚಿದಸಿದ್ಧಂ ತೇ ನ ಚ ಸಿದ್ಧೋಸಿ ಕಸ್ಯಚಿತ್ ||6||'}
      />
      <St
        line1={'ಕಾರ್ಯಾಣಾಂ ಕಾರಣಂ ಪುರ್ವಂ ವಚಸಾಂ ವಾಚ್ಯಮುತ್ತಮಂ|'}
        line2={'ಯೋಗಾನಾಂ ಪರಮಾಂ ಸಿದ್ಧಿಂ ಪರಮಂ ತೇ ಪದಂ ವಿದುಃ||7||'}
      />
      <St
        line1={'ಅಹಂ ಭೀತೋಸ್ಮಿ ದೇವೇಶ ಸಂಸಾರೇಸ್ಮಿನ್ ಭಯಾವಹೇ |'}
        line2={'ಪಾಹಿ ಮಾಂ ಪುಂಡರೀಕಾಕ್ಷ ನ ಜಾನೇ ಶರಣಂ ಪರಂ ||8||'}
      />
      <St
        line1={'ಕಾಲೇಷ್ವಪಿ ಚ ಸರ್ವೇಷು ದಿಕ್ಷು ಸರ್ವಾಸುಚಾಚ್ಯುತ |'}
        line2={'ಶರೀರೇ ಚ ಗತೌ ಚಾಪಿ ವತರ್Àತೇ ಮೆ ಮಹದ್ಭಯಂ ||9||'}
      />
      <St
        line1={'ತ್ವತ್ಪಾದ ಕಮಲಾದನ್ನ್ಯನ್ನ ಮೇ ಜನ್ಮಾಂತರೇಷ್ವಪಿ|'}
        line2={'ನಿಮಿತ್ತಂ ಕುಶಲಸ್ಯಾಸ್ತಿ ಯೇನ ಗಚ್ಛಾಮಿ ಸದ್ಗತಿಂ ||10||'}
      />
      <St
        line1={'ವಿಜ್ಞಾನಂ ಯದಿದಂ ಪ್ರಾಪ್ತಂ ಯದಿದಂ ಸ್ಥಾನಮಾರ್ಜಿತಂ | '}
        line2={'ಜನ್ಮಾಂತರೇಪಿ ಮೇ ದೇವ ಮಾ ಭೂತಸ್ಯ ಪರೀಕ್ಷಯಃ ||11||'}
      />
      <St
        line1={'ದುರ್ಗತಾವಪಿ ಜಾತಾಯಾಂ ತ್ವದ್ಗತೋ ಮೇ ಮನೋರಥಃ|'}
        line2={'ಯದಿ ನಾಶಂ ನ ವಿಂದೇತ ತಾವತಾಸ್ಮಿ ಕೃತೀ ಸದಾ ||12||'}
      />
      <St
        line1={'ನ ಕಾಮಕಲುಷಂ ಚಿತ್ತಂ ಮಮತೇ ಪಾದಯೋಃ ಸ್ಥಿತಂ | '}
        line2={'ಕಾಮಯೇ ವೈಷ್ಣವತ್ವಂ ತು ಸರ್ವಜನ್ಮಸು ಕೇವಲಂ ||13||'}
      />
      <St
        line1={'ಸರ್ವೇಷು ದೇಶ ಕಾಲೇಷು ಸರ್ವಾವಸ್ಥಾಸು ಚಾಚ್ಯುತ | '}
        line2={'ಕಿಂಕರೋಸ್ಮಿ ಹೃಷೀಕೇಶ ಭೂಯೋ ಭೂಯೋಸ್ಮಿ ಕಿಂಕರಃ||14||'}
      />
      <St
        line1={'ಇತ್ಯೇವ ಮನಯಾಸ್ತುತ್ಯಾ ಸ್ತುತ್ವಾ ದೇವಂ ದಿನೇ ದಿನೇ |'}
        line2={'ಕಿಂಕರೋಸ್ಮೀತಿ ಚಾತ್ಮಾನಂ ದೇವಾಯೈವಂ ನಿವೇದಯೇತ್||15||'}
      />
      <St
        line1={'ಯಚ್ಚಾಪರಾಧಂ ಕೃತವಾನ್ ಅಜ್ಞಾನಾತ್ ಪುರುಷೋತ್ತಮ |'}
        line2={'ಮದ್ಭಕ್ತ ಇತಿ ದೇವೇಶ ತತ್ಸರ್ವಂ ಕ್ಷಂತುಮರ್ಹಸಿ ||16||'}
      />
      <St
        line1={'ಅಹಂಕಾರಾರ್ಥ ಕಾಮೇಷು ಪ್ರೀತಿರದ್ಯೈವ ನಶ್ಶತು |'}
        line2={'ತ್ವಾಂ ಪ್ರಪನ್ನಸ್ಯ ಮೇ ದೇವ ವರ್ಧತಾಂ ಶ್ರೀಮತಿ ತ್ವಯಿ||17||'}
      />
      <St
        line1={'ಕ್ವಾಹಮತ್ಯಂತ ದುರ್ಬುದ್ಧಿಃ ಕ್ವ ಚಾತ್ಮ ಹಿತವೀಕ್ಷಣಂ |'}
        line2={'ಯದ್ಧಿತಂ ಮಮ ದೇವೇಶ ತದಾಜ್ಞಾಪಯ ಮಾಧವ ||18||'}
      />
      <St
        line1={'ಸೋಹಂ ತೇ ದೇವ ದೇವೇಶ ನಾರ್ಚನಾದೌ ಸ್ತುತೌ ನ ಚ |'}
        line2={'ಸಾಮಥರ್ಯ್‌ವಾನ್ ಕೃಪಾಮಾತ್ರ ಮನೋವೃತ್ತಿಃ ಪ್ರಸೀದಮೇ||19||'}
      />
      <St
        line1={'ಉಪಚಾರಾ ಪದೇಶೇನ ಕೃತಾನ ಹರಹರ್ಮಯಾ |'}
        line2={'ಅಪಚಾರಾನಿ ಮಾನ್ ಸರ್ವಾನ್ ಕ್ಷಮಸ್ವ ಪುರುಷೋತ್ತಮ||20||'}
      />
    </StWrapper>
  );
};

export default Jitante;
