import React from 'react';
import St from '../Components/St';
import StWrapper from '../Components/StWrapper';
import SubHeader from '../Components/SubHeader';

const RaghuveeraGadya = ({navigation}) => {
  return (
    <StWrapper
      navigation={navigation}
      back={'ShotramScreen'}
      title={'ಶ್ರೀ ರಘುವೀರ ಗದ್ಯಂ'}>
      <St
        line1={
          '1.ಜಯತ್ಯಾಶ್ರಿತಸಂತ್ರಾಸವಿಧ್ವಸನೋದಯಃ |ಪ್ರಭಾವಾನ್  ಸೀತಯಾ ದೇವ್ಯಾ ಪರಮವ್ಯೋಮಭಾಸ್ಕರಃ ||'
        }
      />
      <SubHeader title="ಬಾಲಕಾಂಡಂ" />
      <St line1={'2.ಜಯ ಜಯ ಮಹಾವೀರ !'} />
      <St line1={'3.ಮಹಾಧೀರ ಧೌರೇಯ !'} />
      <St
        line1={
          '4.ದೇವಾಸುರ ಸಮರ ಸಮಯ ಸಮುದಿತ, ನಿಖಿಲ ನಿರ್ಜರ ನಿರ್ಧಾರಿತ, ನಿರವಧಿಕ ಮಾಹಾತ್ಮ್ಯ !'
        }
      />
      <St line1={'5.ದಶವದನ ದಮಿತ ದೈವತ, ಪರಿಷದಭ್ಯರ್ಥಿತ ದಾಶರಥಿ-ಭಾವ !'} />
      <St line1={'6.ದಿನಕರ ಕುಲ ಕಮಲ ದಿವಾಕರ !'} />
      <St line1={'7.ದಿವಿಷದಧಿಪತಿ ರಣ ಸಹಚರಣ, ಚತುರ ದಶರಥ, ಚರಮಋಣ ವಿಮೋಚನ !'} />
      <St line1={'8.ಕೋಸಲಸುತ ಕುಮಾರ ಭಾವ, ಕಂಚುಕಿತ ಕಾರಣಾಕಾರ !'} />
      <St line1={'9.ಕೌಮಾರ ಕೇಳಿ ಗೋಪಾಯಿತ ಕೌಶಿಕಾಧ್ವರ'} />
      <St line1={'10.ರಣಾಧ್ವರ ಧುರ್ಯ ಭವ್ಯ, ದಿವ್ಯಾಸ್ತ್ರ ಬೃನ್ದ ವನ್ದಿತ !'} />
      <St line1={'11.ಪ್ರಣತ ಜನ ವಿಮತ ವಿಮಥನ, ದುರ್ಲಲಿತದೋರ್ಲಲಿತ !'} />
      <St line1={'12.ತನುತರ ವಿಶಿಖವಿತಾಡನ ವಿಘಟಿತ, ವಿಶರಾರು ಶರಾರು ತಾಟಕಾ ತಾಟಕೇಯ !'} />
      <St
        line1={
          '13.ಜಡಕಿರಣ ಶಕಲಧರ, ಜಟಿಲ ನಟ ಪತಿ ಮಕುಟತಟ ನಟನಪಟು ವಿಬುಧ ಸರಿದತಿಬಹುಳ, ಮಧುಗಳನ ಲಲಿತ ಪದ ನಳಿನರಜ ಉಪಮೃದಿತ ನಿಜವೃಜಿನ, ಜಹದುಪಲ‌‌ ತನುರುಚಿರ, ಪರಮಮುನಿವರ ಯುವತಿ ನುತ!'
        }
      />
      <St line1={'14.ಕುಶಿಕಸುತ ಕಥಿತ ವಿದಿತ, ನವ ವಿವಿಧ ಕಥ !'} />
      <St line1={'15.ಮೈಥಿಲ ನಗರ ಸುಲೋಚನಾ ಲೋಚನ ಚಕೋರ ಚನ್ದ್ರ !'} />
      <St line1={'16.ಖಂಡಪರಶು ಕೋದಣ್ಡ ಪ್ರಕಾಣ್ಡ, ಖಣ್ಡನ ಶೌಣ್ಡ ಭುಜ-ದಣ್ಡ !'} />
      <St
        line1={'17.ಚಣ್ಡ-ಕರ ಕಿರಣ-ಮಣ್ಡಲ ಬೋಧಿತ, ಪುಣ್ಡರೀಕ ವನರುಚಿ ಲುಣ್ಟಾಕ ಲೋಚನ!'}
      />
      <St line1={'18.ಮೋಚಿತ ಜನಕ ಹೃದಯ ಶಂಕಾತಂಕ!'} />
      <St
        line1={'19.ಪರಿಹೃತ ನಿಖಿಲ ನರಪತಿ ವರಣ, ಜನಕ-ದುಹಿತ ಕುಚತಟ ವಿಹರಣ,ಸಮುಚಿತ ಕರತಲ !'}
      />
      <St
        line1={
          '20.ಶತಕೋಟಿ ಶತಗುಣ ಕಠಿನ ಪರಶುಧರ, ಮುನಿವರ ಕರಧೃತ ದುರವನಮತಮನಿಜ, ಧನುರಾಕರ್ಷಣ ಪ್ರಕಾಶಿತ ಪಾರಮೇಷ್ಠ್ಯ !'
        }
      />
      <St
        line1={
          '21.ಕ್ರತುಹರಶಿಖರ ಕಂತುಕ ವಿಹೃತ್ಯುನ್ಮುಖ, ಜಗದರುಂತುದ ಜಿತಹರಿ ದಂತಿ ದಂತ ದಂತುರ, ದಶವದನ ದಮನ ಕುಶಲ, ದಶಶತಭುಜ ಮುಖ ನೃಪತಿಕುಲ, ರುಧಿರ ಝರ ಝರ ಭರಿತ ಪೃತುತರ ತುಂಟಾಟ ತೀರ್ಪಿನಂತೆ, ಪಿತೃಕ ಭೃಗಪತಿ ಸುಗತಿ, ವಿಹತಿಕರ ನತ ಪರುಡಿಷು ಪರಿಘ !'
        }
      />
      <SubHeader title="ಅಯೋಧ್ಯಾಕಾಂಡಂ" />
      <St
        line1={
          '22.ಅನೃತ ಭಯ ಮುಷಿತ ಹೃದಯ, ಪಿತೃ ವಚನ ಪಾಲನ, ಪ್ರತಿಜ್ಞಾವಜ್ಞಾತ ಯೌವರಾಜ್ಯ !'
        }
      />
      <St line1={'23.ನಿಷಾದ ರಾಜ ಸೌಹೃದ ಸೂಚಿತ, ಸೌಶೀಲ್ಯ ಸಾಗರ !'} />
      <St
        line1={
          '24.ಭರದ್ವಾಜಶಾಸನಪರಿಗೃಹೀತ, ವಿಚಿತ್ರ ಚಿತ್ರಕೂಟ, ಗಿರಿ ಕಟಕ ತಟ ರಮ್ಯಾವಸಥ !'
        }
      />
      <St line1={'25.ಅನನ್ಯ ಶಾಸನೀಯ !'} />
      <St
        line1={
          '26.ಪ್ರಣತ ಭರತ ಮಕುಟತಟ ಸುಘಟಿತ, ಪಾದುಕಾಗ್ರ್ಯಾಭಿಷೇಕ ನಿರ್ವರ್ತಿತ ,ಸರ್ವಲೋಕ ಯೋಗಕ್ಷೇಮ!'
        }
      />
      <St
        line1={
          '27.ಪಿಶಿತ ರುಚಿ ವಿಹಿತ ದುರಿತ, ವಲಮಥನ ತನಯ, ಬಲಿಭುಗನುಗತಿ ಸರಭಸಶಯನ, ತೃಣ ಶಕಲ ಪರಿಪತನ, ಭಯ ಚಕಿತ ಸಕಲ ಸುರ ಮುನಿವರ,ಬಹುಮತ ಮಹಾಸ್ತ್ರ ಸಾಮರ್ಥ್ಯ !'
        }
      />
      <St line1={'28.ದ್ರುಹಿಣ ಹರ ವಲಮಥನ, ದುರಾಲಕ್ಷ್ಯ ಶರ ಲಕ್ಷ್ಯ !'} />
      <St line1={'29.ದಂಡಕಾ ತಪೋವನ ಜಙ್ಗಮ ಪಾರಿಜಾತ !'} />
      <St line1={'30.ವಿರಾಧ ಹರಿಣ ಶಾರ್ದೂಲ !'} />
      <St
        line1={
          '31.ವಿಲುಲಿತ ಬಹುಫಲ ಮಖ ಕಲಮ, ರಜನಿಚರ ಮೃಗ ಮೃಗಯಾನಮ್ಭ, ಸಂಭೃತಚೀರಭೃದನುರೋಧ !'
        }
      />
      <St line1={'32.ತ್ರಿಶಿರಃ ಶಿರಸ್ತ್ರಿತಯ ತಿಮಿರ ನಿರಾಸ ವಾಸರಕರ !'} />
      <St line1={'33.ದೂಷಣ ಜಲನಿಧಿ ಶೋಶಾಣ ತೋಷಿತ, ಋಷಿ-ಗಣ ಘೋಷಿತ ವಿಜಯ ಘೋಷಣ !'} />
      <St line1={'34.ಖರತರ ಖರ ತರು ಖಣ್ಡನ ಚಣ್ಡ ಪವನ !'} />
      <St line1={'35.ದ್ವಿಸಪ್ತ ರಕ್ಷಃ-ಸಹಸ್ರ ನಲ-ವನ ವಿಲೋಲನ ಮಹಾ-ಕಲಭ !'} />
      <St line1={'36.ಅಸಹಾಯ ಶೂರ !'} />
      <St line1={'37.ಅನಪಾಯ ಸಾಹಸ !'} />
      <St
        line1={
          '38.ಮಹಿತ ಮಹಾ-ಮೃಥ ದರ್ಶನ ಮುದಿತ, ಮೈಥಿಲೀ ದೃಢ-ತರ ಪರಿರಮ್ಭಣ, ವಿಭವವಿರೋಪಿತ ವಿಕಟ ವೀರವ್ರಣ !'
        }
      />
      <St line1={'39.ಮಾರೀಚ ಮಾಯಾ ಮೃಗ ಚರ್ಮ ಪರಿಕರ್ಮಿತ ನಿರ್ಭರ ದರ್ಭಾಸ್ತರಣ !'} />
      <St
        line1={
          '40.ವಿಕ್ರಮ ಯಶೋ ಲಾಭ ವಿಕ್ರೀತ ಜೀವಿತ ಗೃಘ್ರರಾಜ ದೇಹ ದಿಧಕ್ಷಾ ಲಕ್ಷಿತ,ಭಕ್ತಜನ ದಾಕ್ಷಿಣ್ಯ !'
        }
      />
      <St line1={'41.ಕಲ್ಪಿತ ವಿಬುಧ-ಭಾವ ಕಬನ್ಧಾಭಿನನ್ದಿತ !'} />
      <St
        line1={
          '42.ಅವಂದ್ಯ ಮಹಿಮ ಮುನಿಜನ ಭಜನ ಮುಷಿತ, ಹೃದಯ ಕಲುಷ ಶಬರೀ ಮೋಕ್ಷ ಸಾಕ್ಷಿಭೂತ !'
        }
      />
      <SubHeader title="ಕಿಷ್ಕಿಂಧಾಕಾಂಡಂ" />
      <St line1={'43.ಪ್ರಭಂಜನ ತನಯ ಭಾವುಕ ಭಾಷಿತ ರಞ್ಜಿತ ಹೃದಯ !'} />
      <St line1={'44.ತರಣಿಸುತ ಶರಣಾಗತಿಪರತನ್ತ್ರೀಕೃತ ಸ್ವಾತನ್ತ್ರ್ಯ !'} />
      <St
        line1={
          '45.ದೃಢ ಘಟಿತ ಕೈಲಾಸ ಕೋಟಿ ವಿಕಟ ದುನ್ದುಭಿ ಕಙ್ಕಾಲ ಕೂಟ ದೂರ ವಿಕ್ಷೇಪ ದಕ್ಷ-ದಕ್ಷಿಣೇತರ ಪಾದಾಙ್ಗುಷ್ಠ ದರ ಚಲನ ವಿಶ್ವಸ್ತ ಸುಹೃದಾಶಯ !'
        }
      />
      <St
        line1={
          '46.ಅತಿಪೃಥುಲ ಬಹು ವಿಟಪಿ ಗಿರಿ ಧರಣಿ ವಿವರ ಯುಗಪದುದಯ ವಿವೃತ ಚಿತ್ರಪುಙ್ಗ ವೈಚಿತ್ರ್ಯ !'
        }
      />
      <St
        line1={
          '47.ವಿಪುಲ ಭುಜ ಶೈಲ ಮೂಲ ನಿಬಿಡ ನಿಪೀಡಿತ ರಾವಣ ರಣರಣಕ ಜನಕ ಚತುರುದಧಿ ವಿಹರಣ ಚತುರ ಕಪಿ-ಕುಲ ಪತಿ ಹೃದಯ ವಿಶಾಲ ಶಿಲಾತಲ-ದಾರಣ ದಾರುಣ ಶಿಲೀಮುಖ !'
        }
      />
      <SubHeader title="ಸುಂದರಕಾಂಡಂ" />
      <St
        line1={
          '48.ಅಪಾರ ಪಾರಾವಾರ ಪರಿಖಾ ಪರಿವೃತ ಪರಪುರ ಪರಿಸೃತ ದವ ದಹನ ಜವನ-ಪವನ-ಭವ ಕಪಿವರ ಪರಿಷ್ವಙ್ಗ ಭಾವಿತ ಸರ್ವಸ್ವ ದಾನ !'
        }
      />
      <St
        line1={
          '49.ಅಹಿತ ಸಹೋದರ ರಕ್ಷಃ ಪರಿಗ್ರಹ ವಿಸಂವಾದಿವಿವಿಧ ಸಚಿವ ವಿಪ್ರಲಮ್ಭ ಸಮಯ ಸಂರಮ್ಭ ಸಮುಜ್ಜೃಮ್ಭಿತ ಸರ್ವೇಶ್ವರ ಭಾವ !'
        }
      />
      <St line1={'50.ಸಕೃತ್ಪ್ರಪನ್ನ ಜನ ಸಂರಕ್ಷಣ ದೀಕ್ಷಿತ !'} />
      <St line1={'51.ವೀರ !'} />
      <St line1={'52.ಸತ್ಯವ್ರತ !'} />
      <St line1={'53.ಪ್ರತಿಶಯನ ಭೂಮಿಕಾ ಭೂಷಿತ ಪಯೋಧಿ ಪುಲಿನ !'} />
      <St line1={'54.ಪ್ರಳಯ ಶಿಖಿ ಪರುಷ ವಿಶಿಖ ಶಿಖಾ ಶೋಷಿತಾಕೂಪಾರ ವಾರಿ ಪೂರ !'} />
      <St
        line1={
          '55.ಪ್ರಬಲ ರಿಪು ಕಲಹ ಕುತುಕ ಚಟುಲ ಕಪಿ-ಕುಲ ಕರ-ತಲತುಲಿತ ಹೃತ ಗಿರಿನಿಕರ ಸಾಧಿತ ಸೇತು-ಪಧ ಸೀಮಾ ಸೀಮನ್ತಿತ ಸಮುದ್ರ !'
        }
      />
      <St
        line1={
          '56.ದ್ರುತಗತಿ ತರು ಮೃಗ ವರೂಥಿನೀ ನಿರುದ್ಧ ಲಙ್ಕಾವರೋಧ ವೇಪಥು ಲಾಸ್ಯ ಲೀಲೋಪದೇಶ ದೇಶಿಕ ಧನುರ್ಜ್ಯಾಘೋಷ !'
        }
      />
      <St
        line1={
          '57.ಗಗನ-ಚರ ಕನಕ-ಗಿರಿ ಗರಿಮ-ಧರ ನಿಗಮ-ಮಯ ನಿಜ-ಗರುಡ ಗರುದನಿಲ ಲವ ಗಲಿತ ವಿಷ-ವದನ ಶರ ಕದನ !'
        }
      />
      <St
        line1={
          '58.ಅಕೃತಚರ ವನಚರ ರಣ ಕರಣ ವೈಲಕ್ಷ್ಯ ಕೂಣಿತಾಕ್ಷ ಬಹುವಿಧ ರಕ್ಷೋ ಬಲಾಧ್ಯಕ್ಷ ವಕ್ಷಃ ಕವಾಟ ಪಾಟನ ಪಟಿಮ ಸಾಟೋಪ ಕೋಪಾವಲೇಪ !'
        }
      />
      <St
        line1={
          '59.ಕಟುರಟದಟನಿ ಟಙ್ಕೃತಿ ಚಟುಲ ಕಠೋರ ಕಾರ್ಮುಕ ! ವಿಶಙ್ಕಟ ವಿಶಿಖ ವಿತಾಡನ ವಿಘಟಿತ ಮಕುಟ ವಿಹ್ವಲ ವಿಶ್ರವಸ್ತನಯವಿಶ್ರಮ ಸಮಯ ವಿಶ್ರಾಣನ ವಿಖ್ಯಾತ ವಿಕ್ರಮ !'
        }
      />
      <St line1={'60.ಕುಂಭಕರ್ಣ ಕುಲ ಗಿರಿ ವಿದಲನ ದಮ್ಭೋಲಿ ಭೂತ ನಿಃಶಙ್ಕ ಕಙ್ಕಪತ್ರ !'} />

      <St
        line1={
          '61.ಅಭಿಚರಣ ಹುತವಹ ಪರಿಚರಣ ವಿಘಟನ ಸರಭಸ ಪರಿಪತದ್ ಅಪರಿಮಿತಕಪಿಬಲ ಜಲಧಿಲಹರಿ ಕಲಕಲ-ರವ ಕುಪಿತ ಮಘವ-ಜಿದಭಿಹನನ-ಕೃದನುಜ ಸಾಕ್ಷಿಕ ರಾಕ್ಷಸ ದ್ವನ್ದ್ವ-ಯುದ್ಧ !'
        }
      />
      <St line1={'62.ಅಪ್ರತಿದ್ವಂದ್ವ ಪೌರುಷ !'} />
      <St line1={'63.ತ್ರ್ಯಂಬಕ ಸಮಧಿಕ ಘೋರಾಸ್ತ್ರಾಡಮ್ಬರ !'} />
      <St line1={'64.ಸಾರಥಿ ಹೃತ ರಥ ಸತ್ರಪ ಶಾತ್ರವ ಸತ್ಯಾಪಿತ ಪ್ರತಾಪ !'} />
      <St
        line1={
          '65.ಶಿತಶರಕೃತಲವನದಶಮುಖ ಮುಖ ದಶಕ ನಿಪತನ ಪುನರುದಯ ದರಗಲಿತ ಜನಿತ ದರ ತರಲ ಹರಿ-ಹಯ ನಯನ ನಲಿನ-ವನ ರುಚಿ-ಖಚಿತ ನಿಪತಿತ ಸುರ-ತರು ಕುಸುಮ ವಿತತಿ ಸುರಭಿತ ರಥ ಪಥ !'
        }
      />
      <St
        line1={
          '66.ಅಖಿಲ ಜಗದಧಿಕ ಭುಜ ಬಲ ವರ ಬಲ ದಶ-ಲಪನ ಲಪನ ದಶಕ ಲವನ-ಜನಿತ ಕದನ ಪರವಶ ರಜನಿ-ಚರ ಯುವತಿ ವಿಲಪನ ವಚನ ಸಮವಿಷಯ ನಿಗಮ ಶಿಖರ ನಿಕರ ಮುಖರ ಮುಖ ಮುನಿ-ವರ ಪರಿಪಣಿತ!'
        }
      />
      <St
        line1={
          '67.ಅಭಿಗತ ಶತಮಖ ಹುತವಹ ಪಿತೃಪತಿ ನಿರೃತಿ ವರುಣ ಪವನ ಧ ನದಗಿರಿಶಪ್ರಮುಖ ಸುರಪತಿ ನುತಿ ಮುದಿತ !'
        }
      />
      <St line1={'68.ಅಮಿತ ಮತಿ ವಿಧಿ ವಿದಿತ ಕಥಿತ ನಿಜ ವಿಭವ ಜಲಧಿ ಪೃಷತ ಲವ !'} />
      <St line1={'69.ವಿಗತ ಭಯ ವಿಬುಧ ವಿಬೋಧಿತ ವೀರ ಶಯನ ಶಾಯಿತ ವಾನರ ಪೃತನೌಘ !'} />
      <St line1={'70.ಸ್ವ ಸಮಯ ವಿಘಟಿತ ಸುಘಟಿತ ಸಹೃದಯ ಸಹಧರ್ಮಚಾರಿಣೀಕ !'} />
      <St line1={'71.ವಿಭೀಷಣ ವಶಂವದೀ-ಕೃತ ಲಙ್ಕೈಶ್ವರ್ಯ !'} />
      <St line1={'72.ನಿಷ್ಪನ್ನ ಕೃತ್ಯ !'} />
      <St line1={'73.ಖ ಪುಷ್ಪಿತ ರಿಪು ಪಕ್ಷ !'} />
      <St line1={'74.ಪುಷ್ಪಕ ರಭಸ ಗತಿ ಗೋಷ್ಪದೀ-ಕೃತ ಗಗನಾರ್ಣವ !'} />
      <St
        line1={'75.ಪ್ರತಿಜ್ಞಾರ್ಣವ ತರಣ ಕೃತ ಕ್ಷಣ ಭರತ ಮನೋರಥ ಸಂಹಿತ ಸಿಂಹಾಸನಾಧಿರೂಢ !'}
      />
      <St line1={'76.ಸ್ವಾಮಿನ್ !'} />
      <St line1={'77.ರಾಘವ ಸಿಂಹ !'} />
      <SubHeader title={'ಉತ್ತರಕಾಂಡಂ'} />
      <St
        line1={
          '78.ಹಾಟಕ ಗಿರಿ ಕಟಕ ಲಡಹ ಪಾದ ಪೀಠ ನಿಕಟ ತಟ ಪರಿಲುಠಿತ ನಿಖಿಲನೃಪತಿ ಕಿರೀಟ ಕೋಟಿ ವಿವಿಧ ಮಣಿ ಗಣ ಕಿರಣ ನಿಕರ ನೀರಾಜಿತಚರಣ ರಾಜೀವ !'
        }
      />
      <St line1={'79.ದಿವ್ಯ ಭೌಮಾಯೋಧ್ಯಾಧಿದೈವತ !'} />
      <St
        line1={
          '80.ಪಿತೃ ವಧ ಕುಪಿತ ಪರಶು-ಧರ ಮುನಿ ವಿಹಿತ ನೃಪ ಹನನ ಕದನ ಪೂರ್ವಕಾಲಪ್ರಭವ ಶತ ಗುಣ ಪ್ರತಿಷ್ಠಾಪಿತ ಧಾರ್ಮಿಕ ರಾಜ ವಂಶ !'
        }
      />
      <St
        line1={'81.ಶುಭಚರಿತ ರತ ಭರತ ಖರ್ವಿತ ಗರ್ವ ಗನ್ಧರ್ವ ಯೂಥ ಗೀತ ವಿಜಯ ಗಾಥಾಶತ !'}
      />
      <St line1={'82.ಶಾಸಿತ ಮಧು-ಸುತ ಶತ್ರುಘ್ನ ಸೇವಿತ !'} />
      <St line1={'83.ಕುಶ ಲವ ಪರಿಗೃಹೀತ ಕುಲ ಗಾಥಾ ವಿಶೇಷ !'} />
      <St
        line1={
          '84.ವಿಧಿ ವಶ ಪರಿಣಮದಮರ ಭಣಿತಿ ಕವಿವರ ರಚಿತ ನಿಜ ಚರಿತನಿಬನ್ಧನ ನಿಶಮನ ನಿರ್ವೃತ !'
        }
      />
      <St line1={'85.ಸರ್ವ ಜನ ಸಮ್ಮಾನಿತ !'} />
      <St
        line1={
          '86.ಪುನರುಪಸ್ಥಾಪಿತ ವಿಮಾನ ವರ ವಿಶ್ರಾಣನ ಪ್ರೀಣಿತ ವೈಶ್ರವಣ ವಿಶ್ರಾವಿತ ಯಶಃ ಪ್ರಪಞ್ಚ !'
        }
      />

      <St line1={'87.ಪಞ್ಚತಾಪನ್ನ ಮುನಿಕುಮಾರ ಸಞ್ಜೀವನಾಮೃತ !'} />
      <St line1={'88.ತ್ರೇತಾಯುಗ ಪ್ರವರ್ತಿತ ಕಾರ್ತಯುಗ ವೃತ್ತಾನ್ತ !'} />
      <St
        line1={
          '89.ಅವಿಕಲ ಬಹುಸುವರ್ಣ ಹಯ-ಮಖ ಸಹಸ್ರ ನಿರ್ವಹಣ ನಿರ್ವರ್ತಿತ ನಿಜವರ್ಣಾಶ್ರಮ ಧರ್ಮ !'
        }
      />
      <St line1={'90.ಸರ್ವ ಕರ್ಮ ಸಮಾರಾಧ್ಯ !'} />
      <St line1={'91.ಸನಾತನ ಧರ್ಮ !'} />
      <St
        line1={
          '92.ಸಾಕೇತ ಜನಪದ ಜನಿ ಧನಿಕ ಜಙ್ಗಮ ತದಿತರ ಜನ್ತು ಜಾತ ದಿವ್ಯ ಗತಿ ದಾನ ದರ್ಶಿತ ನಿತ್ಯ ನಿಸ್ಸೀಮ ವೈಭವ !'
        }
      />
      <St line1={'93.ಭವ ತಪನ ತಾಪಿತ ಭಕ್ತಜನ ಭದ್ರಾರಾಮ !'} />
      <St line1={'94.ಶ್ರೀ ರಾಮಭದ್ರ !'} />
      <St line1={'95.ನಮಸ್ತೇ ಪುನಸ್ತೇ ನಮಃ ॥'} />
      <St line1={'96.ಅಸಹಾಯ ಶೂರ !'} />
      <St
        line1={
          '97.ಚತುರ್ಮುಖೇಶ್ವರಮುಖೈಃ ಪುತ್ರ ಪೌತ್ರಾದಿ ಶಾಲಿನೇ । ನಮಃ ಸೀತಾ ಸಮೇತಾಯ ರಾಮಾಯ ಗೃಹಮೇಧಿನೇ ॥'
        }
      />
      <St
        line1={
          '98.ಕವಿಕಥಕ ಸಿಂಹಕಥಿತಂ ಕಠೋತ ಸುಕುಮಾರ ಗುಮ್ಭ ಗಮ್ಭೀರಮ್ । ಭವ ಭಯ ಭೇಷಜಮೇತತ್ ಪಠತ ಮಹಾವೀರ ವೈಭವಂ ಸುಧಿಯಃ ॥'
        }
      />
    </StWrapper>
  );
};

export default RaghuveeraGadya;
