import React from 'react';
import StWrapper from '../Components/StWrapper';
import St from '../Components/St';

const RamaLali = ({navigation}) => {
  return (
    <StWrapper
      navigation={navigation}
      back={'BhajaneScreen'}
      title={'ರಾಮ ಲಾಲಿ'}>
      <St line1={'ರಾಮ ಲಾಲಿ ಮೇಘ ಶ್ಯಾಮ ಲಾಲಿ ತಾಮರಸ ಕಾಳನೈನ ತನಿಯಲಾಲಿ'} />
      <St
        line1={'ಸುತ್ರಾಮ ಮಿತ್ರಜಾತ ಪುತ್ರನೇತ್ರಾ ರಾಮ ಮಿತ್ರವಂಶ ಪೂತಾನಾತ ವಿಶ್ವಮೀತ್ರ'}
        line2={'(ರಾಮ) '}
      />
      <St
        line1={'ಲಾಲಿ ಲಾಲಿ ಮತ್ಸ್ಯ ಕೂರ್ಮ ಲಾಲಿ  ವರಹಾರವ ಸಿಂಹ ವಾಮನ  ನಿನಗೆ ಲೀಲೆ ಲಾಲಿ'}
        line2={'(ರಾಮ) '}
      />
      <St
        line1={'ಲಾಲಿ ಲಾಲಿ ಪರಶು ರಾಮಲಾಲಿ  ರಾಮಕೃಷ್ಣ ಬೌದ್ಧ ಕಲ್ಕಿ ಲೀಲೆ ಲಾಲಿ '}
        line2={'(ರಾಮ) '}
      />
      <St
        line1={'ಲಾಲಿ ಲಾಲಿ ಮಯ ಲೋಲ ಲಾಲಿ  ಕಾಯಕರ್ಮವೆಲ್ಲ  ನಿನಗೆ ಲೀಲೆ ಲಾಲಿ'}
        line2={'(ರಾಮ) '}
      />
      <St
        line1={'ಅಂದ ಲಾಲಿ ಮುಚ್ಚು ಕುಂದ ಲಾಲಿ  ಅಂದದಿಂದ ಪವಡಿಸಯ್ಯ ನಂದಲಾಲಿ '}
        line2={'(ರಾಮ) '}
      />
      <St
        line1={
          'ನೀರೊಳು ದೂರಿ ಪಾರಪತ್ತು ಘೋರವಿಖ್ಯತಾರಾಮಾ ಘೋರಸ್ಥಂಭದಿಂದ ಬಂದು ಬಾಲಸ್ಸಲಹೀದೆ '
        }
        line2={'(ರಾಮ) '}
      />
      <St
        line1={
          'ಅಕ್ತಿಯೊಂಬೊ ತೊಟ್ಟಿಲೋಳ್ ಲಾಡು ತಿನ್ನುವೋ ರಾಮ ಅಂದ ಮುದ್ದು ಕಂದ ನೀನಗೆ ಲಾಲಿ ಚೇಸಿನ '
        }
        line2={'(ರಾಮ) '}
      />
      <St
        line1={'ಧೀರ ಲಾಲಿ ಅತಿ ಶೂರಲಾಲಿ ರಾಮ ಮಾರ ಜನಕ ಪುರಂದರ ವಿಠ್ಠಲ ಲಾಲಿ'}
        line2={'(ರಾಮ) '}
      />
      <St
        line1={'ರಂಗ ಲಾಲಿ ಮಂಗಳಾಂಗಲಾಲಿ ರಾಮ ವರಹನಾದ ಸಿಂಹವಹಾನ ನಿನಗೆ ಲಾಲಿ'}
        line2={'(ರಾಮ) '}
      />
    </StWrapper>
  );
};

export default RamaLali;
