import React from 'react';
import St from '../Components/St';
import StWrapper from '../Components/StWrapper';

const ThugireRangana = ({navigation}) => {
  return (
    <StWrapper
      navigation={navigation}
      back={'BhajaneScreen'}
      title={'ತೂಗಿರೆ ರಂಗನ ತೂಗಿರೆ ಕೃಷ್ಣನ'}>
      <St
        line1={'ತೂಗಿರೆ ರಂಗನ ತೂಗಿರೆ ಕೃಷ್ಣನ'}
        line2={'ತೂಗಿರೆ ಅಚ್ಯುತಾನಂತನ'}
        line3={'ತೂಗಿರೆ ವರಗಿರಿಯಪ್ಪ ತಿಮ್ಮಪ್ಪನ'}
        line4={'ತೂಗಿರೆ ಕಾವೇರಿ ರಂಗಯ್ಯನ'}
      />
      <St
        line1={'ನಾಗಲೋಕದಲ್ಲಿ ನಾರಾಯಣ ಮಲಗ್ಯಾನೆ'}
        line2={'ನಾಗ ಕನ್ನಿಕೆಯರು ತೂಗಿರೆ'}
        line3={'ನಾಗವೇಣಿಯರು ನೇಣ ಪಿಡಿದುಕೊಂಡು'}
        line4={'ಬೇಗನೆ ತೊಟ್ಟಿಲ ತೂಗಿರೆ || ೧ ||'}
      />

      <St
        line1={'ಇಂದ್ರಲೋಕದಲ್ಲುಪೇಂದ್ರ ಮಲಗ್ಯಾನೆ'}
        line2={'ಇಂದುಮುಖಿಯರೆಲ್ಲ ತೂಗಿರೆ'}
        line3={'ಇಂದ್ರ ಕನ್ನಿಕೆಯರು ಚಂದದಿ ಬಂದು'}
        line4={'ಮುಕುಂದನ ತೊಟ್ಟಿಲ ತೂಗಿರೆ || ೨ ||'}
      />
      <St
        line1={'ಆಲದೆಲೆಯ ಮೇಲೆ ಶ್ರೀಲೋಲ ಮಲಗ್ಯಾನೆ'}
        line2={'ನೀಲಕುಂತಳೆಯರು ತೂಗಿರೆ'}
        line3={'ವ್ಯಾಳಶಯನ ಹರಿ ಮಲಗು ಮಲಗೆಂದು'}
        line4={'ಬಾಲ ಕೃಷ್ಣಯ್ಯನ ತೂಗಿರೆ || ೩ ||'}
      />
      <St
        line1={'ಸಾಸಿರ ನಾಮನೆ ಸರ್ವೋತ್ತಮನೆಂದು'}
        line2={'ಸೂಸುತ್ತ ತೊಟ್ಟಿಲ ತೂಗಿರೆ'}
        line3={'ವಲೇಸಾಗಿ ಮಡುವಿನೊಳ್ ಶೇಷನ ತುಳಿದಿಟ್ಟ'}
        line4={'ದೋಷ ವಿದೂರನ ತೂಗಿರೆ || ೪ ||'}
      />
      <St
        line1={'ಅರಳೆಲೆ ಮಾಗಾಯಿ ಕೊರಳ ಮುತ್ತಿನ ಹಾರ'}
        line2={'ತರಳನ ತೊಟ್ಟಿಲ ತೂಗಿರೆ'}
        line3={'ಸಿರಿದೇವಿ ರಮಣನೆ ಪುರಂದರ ವಿಠಲನೆ'}
        line4={'ಕರುಣದಿ ಮಲಗೆಂದು ತೂಗಿರೆ || ೫ ||'}
      />
    </StWrapper>
  );
};

export default ThugireRangana;
