import React from "react";
import St from "../Components/St";
import StWrapper from "../Components/StWrapper";

const RadheShyam = ({ navigation }) => {
  return (
    <StWrapper
      title={"ರಾಧೇಶ್ಯಾಮ್‌ ರಾಧೇಶ್ಯಾಮ್"}
      back={"BhajaneScreen"}
      navigation={navigation}
    >
      <St
        line1={
          "ರಾಧೇಶ್ಯಾಮ್‌ ರಾಧೇಶ್ಯಾಮ್‌  ರಾಧಾ ಮಾಧವ ಮೇಘ ಶ್ಯಾಮ್‌  ಆದಿನಾರಾಯಣ ರಾಧೇ ಶ್ಯಾಮ್  ಅನಾದಿ ಪುರುಷ ಮೇಘ ಶ್ಯಾಮ್‌  ವಾಸುದೇವಹರಿ ರಾಧೇ ಶ್ಯಾಮ್  ವಾಸುಕಿ ಶಯನನೆ ಮೇಘ ಶ್ಯಾಮ್ || 1 ||"
        }
      />
      <St
        line1={"ದೇವಕಿ ತನಯ ರಾಧೇ ಶ್ಯಾಮ್‌  ದೇವ ದೇವ ಹರಿ ಮೇಘ ಶ್ಯಾಮ್ ||"}
        line2={"ಭಾವಜನಯ್ಯನೆ ರಾಧೇ ಶ್ಯಾಮ್‌  ಗೋವಳ ಪ್ರಿಯಹರಿ ಮೇಘ ಶ್ಯಾಮ್‌ ||೨||"}
      />
      <St
        line1={
          "ಪೂತನಿ ಮರ್ಧನ ರಾಧೆ ಶ್ಯಾಮ್‌  ಶಕಟ ಸಂಹಾರ ಮೇಘ ಶ್ಯಾಮ್‌ ಮಾತುಳ ಧ್ವಂಸಿ ರಾಧೇ ಶ್ಯಾಮ್ |"
        }
        line2={"ಅನಾಥ ರಕ್ಷಕ ಮೇಘ ಶ್ಯಾಮ್ ||"}
      />
      <St
        line1={"ಮುರಳಿ ಮನೋಹಶ ರಾಧೇ ಶ್ಯಾಮ್‌ | ನರಕಾಂತಕ ಹರಿ ಮೇಘ ಶ್ಯಾಮ್ |"}
        line2={"ಕರುಣಾಕರ ಹರಿ ರಾಧೇ ಶ್ಯಾಮ್‌ | ಕರುಣಿಸಿ ಪೊರೆ ಹರಿ ಮೇಘ ಶ್ಯಾಮ್ || "}
      />
      <St
        line1={"ಪಾಂಡವ ಪ್ರಾಣನೆ ರಾಧೇ ಶ್ಯಾಮ್‌ ||"}
        line2={"ಪಾಂಡವ ತ್ರಾಣನೆ ಮೇಘ ಶ್ಯಾಮ್ |"}
        line3={"ಪಾಂಡವ ರಕ್ಷಕ ರಾಧೇ ಶ್ಯಾಮ್‌ |"}
        line4={"ಕೌರವ ಶಿಕ್ಷಕ ಮೇಘ ಶ್ಯಾಮ್ ||"}
      />
      <St
        line1={"ಗೋಪೀಜಾತನೆ ರಾಧೇ ಶ್ಯಾಮ್‌ |"}
        line2={"ಗೋಪೀನಾಥನೆ ಮೇಘ ಶ್ಯಾಮ್ |"}
        line3={"ಗೋಪಿಕ ವಲ್ಲಭ ರಾಧೇ ಶ್ಯಾಮ್ |"}
        line4={"ಗೋಕುಲ ನಂದನ ಮೇಘ ಶ್ಯಾಮ್‌ "}
      />
      <St
        line1={"ಶ್ರೀಪರಮೇಶನೆ ರಾಧೇ ಶ್ಯಾಮ್‌ |"}
        line2={" ಕೇಶವ ಅಚ್ಯುತ ಮೇಘ ಶ್ಯಾಮ್ |"}
        line3={"ದೋಷ ಕ್ಷಮಿಸಿ ಪೊರೆ ರಾಧೇ ಶ್ಯಾಮ್ |"}
        line4={"ದಾಸ ಕೇಶವನುತ ಮೇಘ ಶ್ಯಾಮ್ ||"}
      />
    </StWrapper>
  );
};

export default RadheShyam;
